tyalie/stm8-binutils-gdb/opcodes/stm8-opc.c
  { "sla", { ST8_LONGMEM }, 0x7258 },
  { "sla", { ST8_INDX }, 0x78 },
  { "sla", { ST8_SHORTOFF_X }, 0x68 },
  { "sla", { ST8_LONGOFF_X }, 0x7248 },
  { "sla", { ST8_INDY }, 0x9078 },
  { "sla", { ST8_SHORTOFF_Y }, 0x9068 },
  { "sla", { ST8_LONGOFF_Y }, 0x9048 },
  { "sla", { ST8_SHORTOFF_SP }, 0x08 },
  { "sla", { ST8_SHORTPTRW }, 0x9238 },
  { "sla", { ST8_LONGPTRW }, 0x7238 },
  { "sla", { ST8_SHORTPTRW_X }, 0x9268 },
  { "sla", { ST8_LONGPTRW_X }, 0x7268 },
  { "sla", { ST8_SHORTPTRW_Y }, 0x9168 },
  // slaw
  { "slaw", { ST8_REG_X }, 0x58 },
  { "slaw", { ST8_REG_Y }, 0x9058 },
  // sra
  { "sra", { ST8_REG_A }, 0x47 },
  { "sra", { ST8_SHORTMEM }, 0x37 },
  { "sra", { ST8_LONGMEM }, 0x7257 },
  { "sra", { ST8_INDX }, 0x77 },
  { "sra", { ST8_SHORTOFF_X }, 0x67 },
  { "sra", { ST8_LONGOFF_X }, 0x7247 },
  { "sra", { ST8_INDY }, 0x9077 },
  { "sra", { ST8_SHORTOFF_Y }, 0x9067 },
  { "sra", { ST8_LONGOFF_Y }, 0x9047 },
  { "sra", { ST8_SHORTOFF_SP }, 0x07 },
  { "sra", { ST8_SHORTPTRW }, 0x9237 },
  { "sra", { ST8_LONGPTRW }, 0x7237 },
  { "sra", { ST8_SHORTPTRW_X }, 0x9267 },
  { "sra", { ST8_LONGPTRW_X }, 0x7267 },
  { "sra", { ST8_SHORTPTRW_Y }, 0x9167 },
  // sraw
  { "sraw", { ST8_REG_X }, 0x57 },
  { "sraw", { ST8_REG_Y }, 0x9057 },
  // srl
  { "srl", { ST8_REG_A }, 0x44 },
  { "srl", { ST8_SHORTMEM }, 0x34 },
  { "srl", { ST8_LONGMEM }, 0x7254 },
  { "srl", { ST8_INDX }, 0x74 },
  { "srl", { ST8_SHORTOFF_X }, 0x64 },
  { "srl", { ST8_LONGOFF_X }, 0x7244 },
  { "srl", { ST8_INDY }, 0x9074 },
  { "srl", { ST8_SHORTOFF_Y }, 0x9064 },
  { "srl", { ST8_LONGOFF_Y }, 0x9044 },
  { "srl", { ST8_SHORTOFF_SP }, 0x04 },
  { "srl", { ST8_SHORTPTRW }, 0x9234 },
  { "srl", { ST8_LONGPTRW }, 0x7234 },
  { "srl", { ST8_SHORTPTRW_X }, 0x9264 },
  { "srl", { ST8_LONGPTRW_X }, 0x7264 },
  { "srl", { ST8_SHORTPTRW_Y }, 0x9164 },
  // sraw
  { "srlw", { ST8_REG_X }, 0x54 },
  { "srlw", { ST8_REG_Y }, 0x9054 },
  // sub
  { "sub", { ST8_REG_A, ST8_BYTE }, 0xA0 },
  { "sub", { ST8_REG_A, ST8_SHORTMEM }, 0xB0 },
  { "sub", { ST8_REG_A, ST8_LONGMEM }, 0xC0 },
  { "sub", { ST8_REG_A, ST8_INDX }, 0xF0 },
  { "sub", { ST8_REG_A, ST8_SHORTOFF_X }, 0xE0 },
  { "sub", { ST8_REG_A, ST8_LONGOFF_X }, 0xD0 },
  { "sub", { ST8_REG_A, ST8_INDY }, 0x90F0 },
  { "sub", { ST8_REG_A, ST8_SHORTOFF_Y }, 0x90E0 },
  { "sub", { ST8_REG_A, ST8_LONGOFF_Y }, 0x90D0 },
  { "sub", { ST8_REG_A, ST8_SHORTOFF_SP }, 0x10 },
  { "sub", { ST8_REG_A, ST8_SHORTPTRW }, 0x92C0 },
  { "sub", { ST8_REG_A, ST8_LONGPTRW }, 0x72C0 },
  { "sub", { ST8_REG_A, ST8_SHORTPTRW_X }, 0x92D0 },
  { "sub", { ST8_REG_A, ST8_LONGPTRW_X }, 0x72D0 },
  { "sub", { ST8_REG_A, ST8_SHORTPTRW_Y }, 0x91D0 },
  { "sub", { ST8_REG_SP, ST8_BYTE }, 0x52 },
  // subw
  { "subw", { ST8_REG_X, ST8_WORD }, 0x1D },
  { "subw", { ST8_REG_X, ST8_LONGMEM }, 0x72B0 },
  { "subw", { ST8_REG_X, ST8_SHORTOFF_SP }, 0x72F0 },
  { "subw", { ST8_REG_Y, ST8_WORD }, 0x72A2 },
  { "subw", { ST8_REG_Y, ST8_LONGMEM }, 0x72B2 },
  { "subw", { ST8_REG_Y, ST8_SHORTOFF_SP }, 0x72F2 },
  // swap
  { "swap", { ST8_REG_A }, 0x4E },
  { "swap", { ST8_SHORTMEM }, 0x3E },
  { "swap", { ST8_LONGMEM }, 0x725E },
  { "swap", { ST8_INDX }, 0x7E },
  { "swap", { ST8_SHORTOFF_X }, 0x6E },
  { "swap", { ST8_LONGOFF_X }, 0x724E },
  { "swap", { ST8_INDY }, 0x907E },
  { "swap", { ST8_SHORTOFF_Y }, 0x906E },
  { "swap", { ST8_LONGOFF_Y }, 0x904E },
  { "swap", { ST8_SHORTOFF_SP }, 0x0E },
  { "swap", { ST8_SHORTPTRW }, 0x923E },
  { "swap", { ST8_LONGPTRW }, 0x723E },
  { "swap", { ST8_SHORTPTRW_X }, 0x926E },
  { "swap", { ST8_LONGPTRW_X }, 0x726E },
  { "swap", { ST8_SHORTPTRW_Y }, 0x916E },
  // swapw
  { "swapw", { ST8_REG_X }, 0x5E },
  { "swapw", { ST8_REG_Y }, 0x905E },
  // tnz
  { "tnz", { ST8_REG_A }, 0x4D },
  { "tnz", { ST8_SHORTMEM }, 0x3D },
  { "tnz", { ST8_LONGMEM }, 0x725D },
  { "tnz", { ST8_INDX }, 0x7D },
  { "tnz", { ST8_SHORTOFF_X }, 0x6D },
  { "tnz", { ST8_LONGOFF_X }, 0x724D },
  { "tnz", { ST8_INDY }, 0x907D },
  { "tnz", { ST8_SHORTOFF_Y }, 0x906D },
  { "tnz", { ST8_LONGOFF_Y }, 0x904D },
  { "tnz", { ST8_SHORTOFF_SP }, 0x0D },
  { "tnz", { ST8_SHORTPTRW }, 0x923D },
  { "tnz", { ST8_LONGPTRW }, 0x723D },
  { "tnz", { ST8_SHORTPTRW_X }, 0x926D },
  { "tnz", { ST8_LONGPTRW_X }, 0x726D },
  { "tnz", { ST8_SHORTPTRW_Y }, 0x916D },
  // tnzw
  { "tnzw", { ST8_REG_X }, 0x5D },
  { "tnzw", { ST8_REG_Y }, 0x905D },
  // trap
  { "trap", {}, 0x83 },
  // wfe
  { "wfe", {}, 0x728F },
  // wfi
  { "wfi", {}, 0x8F },
  // xor
  { "xor", { ST8_REG_A, ST8_BYTE }, 0xA8 },
  { "xor", { ST8_REG_A, ST8_SHORTMEM }, 0xB8 },
  { "xor", { ST8_REG_A, ST8_LONGMEM }, 0xC8 },
  { "xor", { ST8_REG_A, ST8_INDX }, 0xF8 },
  { "xor", { ST8_REG_A, ST8_SHORTOFF_X }, 0xE8 },
  { "xor", { ST8_REG_A, ST8_LONGOFF_X }, 0xD8 },
  { "xor", { ST8_REG_A, ST8_INDY }, 0x90F8 },
  { "xor", { ST8_REG_A, ST8_SHORTOFF_Y }, 0x90E8 },
  { "xor", { ST8_REG_A, ST8_LONGOFF_Y }, 0x90D8 },
  { "xor", { ST8_REG_A, ST8_SHORTOFF_SP }, 0x18 },
  { "xor", { ST8_REG_A, ST8_SHORTPTRW }, 0x92C8 },
  { "xor", { ST8_REG_A, ST8_LONGPTRW }, 0x72C8 },
  { "xor", { ST8_REG_A, ST8_SHORTPTRW_X }, 0x92D8 },
  { "xor", { ST8_REG_A, ST8_LONGPTRW_X }, 0x72D8 },
  { "xor", { ST8_REG_A, ST8_SHORTPTRW_Y }, 0x91D8 },
  { NULL, { ST8_END }, 0 },
};

int
stm8_num_opcode_operands (struct stm8_opcodes_s opcode)
{
  int i;
  for (i = 0; opcode.constraints[i]; i++)
    ;
  return i;
}

unsigned int
stm8_opcode_size (unsigned int number)
{
  int i;
  for (i = sizeof (int); i > 0; i--)
    {
      if (number & 0xFF << (i - 1) * 8)
        return (i);
    }
  return (1);
}

int
stm8_compute_insn_size (struct stm8_opcodes_s opcode)
{
  int i, ret = 0;
  for (i = 0; opcode.constraints[i] != ST8_END; i++)
    {
      switch (opcode.constraints[i])
        {
        case ST8_PCREL:
        case ST8_SHORTMEM:
        case ST8_BYTE:
        case ST8_SHORTPTRW_Y:
        case ST8_SHORTPTRW_X:
        case ST8_SHORTPTRW:
        case ST8_SHORTOFF_X:
        case ST8_SHORTOFF_Y:
        case ST8_SHORTOFF_SP:
          ret++;
          break;
        case ST8_LONGPTRE_Y:
        case ST8_LONGPTRE_X:
        case ST8_LONGPTRW_Y:
        case ST8_LONGPTRW_X:
        case ST8_LONGPTRE:
        case ST8_LONGPTRW:
        case ST8_LONGOFF_X:
        case ST8_LONGOFF_Y:
        case ST8_LONGMEM:
        case ST8_WORD:
          ret += 2;
          break;
        case ST8_EXTMEM:
        case ST8_EXTOFF_X:
        case ST8_EXTOFF_Y:
          ret += 3;
          break;
        case ST8_END:
        case ST8_BIT_0:
        case ST8_BIT_1:
        case ST8_BIT_2:
        case ST8_BIT_3:
        case ST8_BIT_4:
        case ST8_BIT_5:
        case ST8_BIT_6:
        case ST8_BIT_7:
        case ST8_REG_CC:
        case ST8_REG_A:
        case ST8_REG_X:
        case ST8_REG_Y:
        case ST8_REG_SP:
        case ST8_REG_XL:
        case ST8_REG_XH:
        case ST8_REG_YL:
        case ST8_REG_YH:
        case ST8_INDX:
        case ST8_INDY:
          break;
        }
    }
  ret += stm8_opcode_size (opcode.bin_opcode);
  return (ret);
}
